# Little nice utilities
brew "ack"
brew "asdf"
brew "bat"
brew "dust"
brew "fd"
brew "fswatch"
brew "fzf"
brew "gping"
brew "htop"
brew "mtr"
brew "ripgrep"
brew "smartmontools"
brew "socat"
brew "tldr"
brew "tree"
brew "tree-sitter"
brew "vale"
brew "wakeonlan"
brew "wordnet"

# Erlang's stuff
brew "fop"
brew "libxslt"
brew "wxwidgets" # for Erlang's :observer.start()

# Nerves (https://www.nerves-project.org/) utilities
brew "coreutils"
brew "fwup"
brew "pkg-config"
brew "squashfs"
brew "xz"

# Bigger applications
brew "ansible"
brew "exercism"
brew "exiftool"
brew "ffmpeg"
brew "fish"
brew "flyctl"
brew "git"
brew "git-lfs"
brew "hashicorp/tap/terraform"
brew "imagemagick"
brew "neovim"
brew "newsboat"
brew "nmap"
brew "openssl"
brew "rbenv-gemset"
brew "tmate"
brew "tmux"

# Casks
cask "xquartz" # for :observer.start() running in Docker
cask "poedit" # translation editor (gettext)
cask "wireshark"
