# Little nice utilities
brew "ack"
brew "asdf"
brew "bat"
brew "btop" # resource monitor for processor, memory, disks, network and processes
brew "direnv"
brew "dust"
brew "fastfetch" # cross-platform neofetch-like system information tool
brew "fd"
brew "fswatch"
brew "fzf"
brew "gping"
brew "htop"
brew "kubectx"
brew "lychee" # fast, async, resource-friendly link checker
brew "mtr"
brew "ripgrep"
brew "smartmontools"
brew "socat"
brew "ssh-vault" # encrypt/decrypt messages with SSH keys
brew "tldr"
brew "tree"
brew "tree-sitter"
brew "wakeonlan"
brew "wordnet"
brew "yt-dlp" # audio/video downloader
brew "zbar" # barcodes-reading tools (incl. QR ones)

# Erlang's stuff
brew "fop"
brew "libxslt"
brew "wxwidgets" # for Erlang's :observer.start()

# Nerves (https://www.nerves-project.org/) utilities
brew "coreutils"
brew "fwup"
brew "pkg-config"
brew "squashfs"
brew "xz"

# Bigger applications
brew "ansible"
brew "awscli"
brew "bitwarden-cli"
brew "colima" # needed for the 'headless' Docker installation
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "exercism"
brew "exiftool"
brew "ffmpeg"
brew "fish"
brew "flyctl"
brew "git"
brew "git-lfs"
brew "hashicorp/tap/terraform"
brew "imagemagick"
brew "neovim"
brew "newsboat"
brew "nmap"
brew "openssl"
brew "rbenv-gemset"
brew "tmate"
brew "tmux"

# Casks
cask "adobe-creative-cloud"
cask "alacritty"
cask "betterdisplay"
cask "bitwarden"
cask "bruno" # like a Postman, but local
cask "charles" # proxy, middle man, debug
cask "chromedriver" # for headless testing via Chrome
cask "db-browser-for-sqlite" # https://sqlitebrowser.org/
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "firefox"
cask "font-meslo-lg-nerd-font"
cask "gnucash"
cask "google-chrome"
cask "handbrake"
cask "hex-fiend" # fast hex editor
cask "hugin" # panorama photo stitcher
cask "imageoptim"
cask "inkscape" # vector graphics editor
cask "istat-menus"
cask "karabiner-elements" # keyboard customizer (remap any key to another)
cask "key-codes" # display key code, unicode value and modifier keys state for any key combination
cask "logi-options-plus"
cask "obs"
cask "obsidian"
cask "paragon-ntfs"
cask "pinta" # simple GTK paint program
cask "poedit" # translation editor (gettext)
cask "postico" # gui client for Postgres
# cask "rectangle" # keyboard shortcuts window manager
cask "rectangle-pro" # keyboard shortcuts window manager, paid pro version
cask "slack"
cask "telegram"
cask "transmission"
cask "unshaky" # fix for double key presses on Apple's butterfly keyboard
cask "valentina-studio" # visual editors for data
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "xquartz" # for :observer.start() running in Docker
cask "wireshark"
